export function createPDF() {
  let name = document.getElementById('manager')
  let egn = document.getElementById('egn')
  let firma = document.getElementById("firma")
  let latinica = document.getElementById("latinica")

  let adres = document.getElementById("adres")
  let owner = document.getElementById("sobstvenik")
  let egnOwner = document.getElementById("egnOwner")
  let capital = document.getElementById("capital")
  let den = document.getElementById("kvo").value

  let reversedDen = den.split("-").reverse().join(".")
  if (name.value.length == 0 || egn.value.length == 0 || firma.value.length == 0 || latinica.value.length == 0 || adres.value.length == 0 || capital.value.length == 0 || den.length == 0) {
    alert("ПОПЪЛНЕТЕ ВСИЧКИ ПОЛЕТА!");
    return false;
  }


  let own = 0;
  let egnOwn = 0;
  if (owner.value.length > 0) {
    own = owner.value
    egnOwn = egnOwner.value
  } else {
    own = name.value;
    egnOwn = egn.value
  }




  let dekl141 = `<h3 style="text-align:center;">ДЕКЛАРАЦИЯ ЗА ОБСТОЯТЕЛСТВАТА по чл.141, ал.8 и чл.142 от ТЗ</h3> <br> 
         Допуподписаният, <b>${name.value.toUpperCase()}</b>, с <b>ЕГН: ${egn.value}</b>, управител на <b>"${firma.value.toUpperCase()}"" ЕООД</b>, със седалище 
         и адрес на управление: ${adres.value} <br><h3 style="text-align:center;">ДЕКЛАРИРАМ, ЧЕ:</h3> <br> 1. Не съм обявен в несъстоятелност;<br>
2. Не съм бил управител, член на управителен или контролен орган на дружество, прекратено поради несъстоятелност през последните две години, предхождащи датата на решението за обявяване на несъстоятелността, ако са останали неудовлетворени кредитори;<br>
3. Не съм бил управител и лице, което е било управител, член на управителен или контролен орган на дружество, за което е било установено с влязло в сила наказателно постановление неизпълнение на задължения по създаване и съхраняване на определените му нива от запаси по Закона за запасите от нефт и нефтопродукти.<br>
4. Без съгласието на дружеството няма:<br>
- от свое или от чуждо име да извършвам търговски сделки;<br>
- да участвам в събирателни или командитни дружества, както и в дружества с ограничена отговорност;<br>
- да заемам длъжност в ръководни органи на други дружества.<br><br>
 <h5 style="text-align:center;">  Известна ми е наказателната отговорност по чл.313 от НК за неверни данни.</h5>
 <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
  <h3 style="text-align:center;">ДЕКЛАРАТОР..............</h3> <br>`

  let spesimen = `<h3 style="text-align:center;"> СЪГЛАСИЕ ЗА ПРИЕМАНЕ НА УПРАВЛЕНИЕ И ОБРАЗЕЦ ОТ ПОДПИСА по чл.141 ал.3 от ТЗ</h3> <br><br>
  Долуподписаният, <b> ${name.value.toUpperCase()}, с ЕГН: ${egn.value}  </b>, <br><br>
<p style="text-align:center;"> ДЕКЛАРИРАМ, ЧЕ </p ><br><br>
Съм съгласен и приемам да управлявам и представлявам <b>"${firma.value.toUpperCase()}" ЕООД </b>, със седалище и адрес на управление: ${adres.value} <br><br><br>
<p style="padding: 35px;"> Подписвам се,  както следва: </p> <br><br><br><br>
<p style="padding-left: 360px;"> .....................</p> <br><br><br><br>
         <h3 style="text-align:center;">ДЕКЛАРАТОР...................</h3> <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>`

  let reshenieES = `<h3 style="text-align:center;"> Р Е Ш Е Н И Я <br>
на едноличния собственик на капитала на еднолично дружество с ограничена отговорност „${firma.value.toUpperCase()}” ЕООД </h3> <br>
Днес, на ${reversedDen}г., аз <b>${own.toUpperCase()}, ЕГН: ${egnOwn} </b> взех следните: <br><br> 
<h3 style="text-align:center;">РЕШЕНИЯ:</h3> <br><br><br><br> 
1. Да учредя еднолично дружество с ограничена отговорност с фирма <b>„${firma.value.toUpperCase()}” ЕООД.</b> <br>
2. Дружеството има следните: <br>
<b>ФИРМА: „${firma.value.toUpperCase()}”</b>, което се изписва на латиница <b>„${latinica.value.toUpperCase()}” Ltd.</b> <br>
<b>СЕДАЛИЩЕ И АДРЕС НА УПРАВЛЕНИЕ:</b> Седалището на дружеството е: ${adres.value}. <br>
<b>ПРЕДМЕТ НА ДЕЙНОСТ:</b> сделки с недвижими имоти и вещни права върху тях, наеми, предприемачество, пътнически и товарни превози,
 хотелиерство и ресторантьорство, туристическа дейност, производство и търговия на едро и дребно със строителни материали, хранителни и промишлени стоки, 
 снабдителска дейност, рекламна, информационна, програмна и импресарска дейност, сделки с интелектуална собственост, дейност на търговско представителство, 
 посредничество и агентство; внос и износ на стоки, отдаване на леки и товарни автомобили под наем,<b> както и всяка друга дейност, незабранена със закон.</b> <br>
<b>СРОК:</b> Дружеството се учредява за неопределен срок; <br>
<b>ЕДНОЛИЧЕН СОБСТВЕНИК НА КАПИТАЛА: ${own.toUpperCase()}, ЕГН: ${egnOwn} </b>. <br>
<b>РАЗМЕР НА КАПИТАЛА: ${capital.value} </b> лева, разпределен в ${capital.value} дяла; <br>
<b>РАЗМЕР НА ДЯЛОВЕТЕ:</b> по <b>1 (един) лев </b> всеки един дял; <br>
<b>УПРАВЛЕНИЕ И НАЧИН НА ПРЕДСТАВИТЕЛСТВО:</b> Дружеството се управлява и представлява от <b>${name.value.toUpperCase()}, ЕГН: ${egn.value} </b>. <br>     
3. Към момента на подаване на заявление за вписване на дружеството в Търговския регистър към Агенция по вписванията уставният капитал да бъде внесен изцяло по набирателна банкова сметка. <br>
4. Съставих и подписах учредителен акт на дружеството, в който са отразени горните обстоятелства. <br><br><br><br><br><br>
<b>ЕДНОЛИЧЕН СОБСТВЕНИК:</b>  ……………………………….. <br><br><br><br><br><br><br><br><br><br><br><br><br>`

  let dekl13 = `<h3 style="text-align:center;">ДЕКЛАРАЦИЯ  по чл.13, ал.4 от ТЗ</h3> <br>
Долуподписаният: <b> ${name.value.toUpperCase()}, ЕГН: ${egn.value} </b>, <br> <br>
ДЕКЛАРИРАМ истинността на заявените от мен обстоятелства и приемането на представените за обявяване актове. <br><br>
    Известна ми е наказателната отговорност, която нося по чл.313 от Наказателния кодекс,
     за деклариране на неверни данни.<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
     <b>ДЕКЛАРАТОР:</b> ……………….. <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>`

  let akt = `<h3 style="text-align:center;">УЧРЕДИТЕЛЕН АКТ на <br> "${firma.value.toUpperCase()}" ЕООД</h3> <br><br>
 Днес, на ${reversedDen}г., аз <b>${own.toUpperCase()}, ЕГН: ${egnOwn}, </b>
 приех настоящия Учредителен акт на еднолично дружество с ограничена отговорност /ЕООД/  „${firma.value.toUpperCase()}” , както следва: <br><br>
 <h4 style="text-align:center;">Раздел I. Фирма и седалище на Дружеството </h4> <br><br>
 Чл. 1.  С настоящия учредителен акт се образува еднолично дружество с ограничена отговорност по смисъла на чл. 113 от Търговския закон
  с наименование <b>„${firma.value.toUpperCase()}”</b>, което се изписва на латиница <b>„${latinica.value.toUpperCase()}” Ltd.</b> <br>
Чл. 2.  Седалището и адресът на управление на дружеството е: Република България, ${adres.value}. <br><br>
<h4 style="text-align:center;">Раздел II. Предмет на дейност и срок </h4> <br><br>
Чл. 3.  Предметът на дейност на дружеството е следният: сделки с недвижими имоти и вещни права върху тях, наеми, предприемачество, 
  пътнически и товарни превози, хотелиерство и ресторантьорство, туристическа дейност, производство и търговия на едро и дребно със строителни материали, 
  хранителни и промишлени стоки, снабдителска дейност, рекламна, информационна, програмна и импресарска дейност, сделки с интелектуална собственост, дейност на търговско представителство, 
  посредничество и агентство; внос и износ на стоки, отдаване на леки и товарни автомобили под наем,
   <b> както и всяка друга дейност, незабранена със закон. </b> <br><br>
   Чл. 4.  Дружеството се образува без определен срок. <br><br>
   <h4 style="text-align:center;">Раздел Раздел III.Капитал </h4> <br><br>
   Чл. 5.  Капиталът на Дружеството се определя в левове и е в размер на <b>${capital.value} лв.</b>, разпределен в <b>${capital.value} дяла </b> с номинална стойност <b> 1 (един) лев </b> всеки един. 
Едноличен собственик на капитала на Дружеството е <b>${own.toUpperCase()}, ЕГН: ${egnOwn} </b>, <br>   
С решение на едноличния собственик, капиталът може да се увеличава за сметка на печалбата на Дружеството или други предвидени в закона способи. <br><br>
<h4 style="text-align:center;"> Раздел IV. Съдружници, права и задължения </h4> <br><br>
Чл. 6.  Нов съдружник в дружеството се приема с писмена молба до едноличния собственик на капитала. Към молбата задължително трябва да се приложи декларация, че новият съдружник приема членството при условията на настоящия учредителен акт. <br><br>
Чл. 7.  Отговорността на едноличния собственик на капитала се ограничава до размера на дяловото му участие в капитала на дружеството. <br><br>
Чл. 8.  Едноличният собственик на капитала е длъжен да пази тайните на дружеството /търговски, производствени и др./ и тайните на клиентите, включително и след напускане на дружеството в срок от пет години.
При нарушение се носи отговорност по българското законодателство. <br><br>
<h4 style="text-align:center;"> Раздел V. Управление </h4> <br><br>   
Чл. 9.  Едноличният собственик на капитала взема решения по всички въпроси, свързани с дейността на дружеството. <br><br>
Чл. 10.  Едноличният собственик има изключителната компетентност за приемане на решения относно: <br>
-  изменение и допълнение на устава; <br>
-  приемане на нови съдружници;<br>
-  даване на съгласие за прехвърляне на дял;<br>
-  вземане на решение за увеличаване и намаляване на уставния капитал на дружеството;<br>
-  приемане на годишните отчети и баланси на дружеството;<br>
-  разпределяне на печалбите на дружеството;<br>
-  избиране и освобождаване от длъжност на управителите на дружеството и техните заместници и определяне на възнаграждението им;<br>
-  откриване и закриване на поделения и представителства и участие или прекратяване на участието в дружества в страната и в чужбина;<br>
-  отчуждаване на недвижими имоти и вещни права върху тях;<br>
-  прекратяване на дружеството. <br><br>
Чл. 11.  Дружеството се управлява и представлява от <b>${name.value.toUpperCase()}, ЕГН: ${egn.value} </b>. <br><br>
Чл. 12.  Управителят има следните правомощия: <br>
-  да представлява дружеството;<br>
-  да решава оперативни въпроси, свързани с дейността му;<br>
-  да определя и контролира разходите на дружеството;<br>
-  да урежда отношенията на дружеството с бюджета;<br>
-  да сключва трудови договори с работниците и служителите;<br>
-  да сключва договори с трети лица, свързани със стопанската дейност на дружеството.<br><br>
Чл. 13.  Управителят отговаря имуществено за виновно причинени вреди на дружеството. <br><br>
<h4 style="text-align:center;"> Раздел VI. Имущество </h4> <br><br>
Чл. 14.  Печалбата на дружеството е  в полза на едноличния собственик на капитала, освен ако същият не вземе решение от чистата печалба да се направят
 отчисления във фондовете на дружеството, да се определят средствата за закупуване на имущество, за резерв, за увеличение на капитала и за други цели в 
 интерес на дружеството. Може да бъде взето решение цялата чиста печалба да бъде предназначена за такива цели. <br><br>
Чл. 15.  Когато дружеството приключи годината със загуба, редът за нейното покриване се определя с решение на едноличния собственик на капитала. <br><br>
<h4 style="text-align:center;"> Раздел VII. Прекратяване, Общи разпоредби</h4> <br><br>
Чл. 16.  Дружеството се прекратява с решение на едноличния собственик на капитала и в предвидените от закона случаи. <br><br>
Чл. 17.  За неуредените в този Учредителен акт случаи се прилагат общите разпоредби на Търговския закон на Република България и общото българско законодателство. <br><br>
Чл. 18.  Договорът се състави в два еднообразни екземпляра –за едноличния собственик на капитала и един екземпляр, който да бъде вписан в Агенция по вписванията – Търговски регистър. <br><br><br><br>
 ................<br>
 <b>${own.toUpperCase()}</b> - едноличен собственик <br>
 на капитала на ${firma.value.toUpperCase()} <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br> `

  let zalichenAkt = `<h3 style="text-align:center;">УЧРЕДИТЕЛЕН АКТ на <br> "${firma.value.toUpperCase()}" ЕООД</h3> <br><br>
 Днес, на ${reversedDen}г., аз <b>${own.toUpperCase()}, ЕГН: **********, </b>
 приех настоящия Учредителен акт на еднолично дружество с ограничена отговорност /ЕООД/  „${firma.value.toUpperCase()}” , както следва: <br><br>
 <h4 style="text-align:center;">Раздел I. Фирма и седалище на Дружеството </h4> <br><br>
 Чл. 1.  С настоящия учредителен акт се образува еднолично дружество с ограничена отговорност по смисъла на чл. 113 от Търговския закон
  с наименование <b>„${firma.value.toUpperCase()}”</b>, което се изписва на латиница <b>„${latinica.value.toUpperCase()}” Ltd.</b> <br>
Чл. 2.  Седалището и адресът на управление на дружеството е: Република България, ${adres.value}. <br><br>
<h4 style="text-align:center;">Раздел II. Предмет на дейност и срок </h4> <br><br>
Чл. 3.  Предметът на дейност на дружеството е следният: сделки с недвижими имоти и вещни права върху тях, наеми, предприемачество, 
  пътнически и товарни превози, хотелиерство и ресторантьорство, туристическа дейност, производство и търговия на едро и дребно със строителни материали, 
  хранителни и промишлени стоки, снабдителска дейност, рекламна, информационна, програмна и импресарска дейност, сделки с интелектуална собственост, дейност на търговско представителство, 
  посредничество и агентство; внос и износ на стоки, отдаване на леки и товарни автомобили под наем,
   <b> както и всяка друга дейност, незабранена със закон. </b> <br><br>
   Чл. 4.  Дружеството се образува без определен срок. <br><br>
   <h4 style="text-align:center;">Раздел Раздел III.Капитал </h4> <br><br>
   Чл. 5.  Капиталът на Дружеството се определя в левове и е в размер на <b>${capital.value} лв.</b>, разпределен в <b>${capital.value} дяла </b> с номинална стойност <b> 1 (един) лев </b> всеки един. 
Едноличен собственик на капитала на Дружеството е <b>${own.toUpperCase()}, ЕГН: ********** </b>, <br>   
С решение на едноличния собственик, капиталът може да се увеличава за сметка на печалбата на Дружеството или други предвидени в закона способи. <br><br>
<h4 style="text-align:center;"> Раздел IV. Съдружници, права и задължения </h4> <br><br>
Чл. 6.  Нов съдружник в дружеството се приема с писмена молба до едноличния собственик на капитала. Към молбата задължително трябва да се приложи декларация, че новият съдружник приема членството при условията на настоящия учредителен акт. <br><br>
Чл. 7.  Отговорността на едноличния собственик на капитала се ограничава до размера на дяловото му участие в капитала на дружеството. <br><br>
Чл. 8.  Едноличният собственик на капитала е длъжен да пази тайните на дружеството /търговски, производствени и др./ и тайните на клиентите, включително и след напускане на дружеството в срок от пет години.
При нарушение се носи отговорност по българското законодателство. <br><br>
<h4 style="text-align:center;"> Раздел V. Управление </h4> <br><br>   
Чл. 9.  Едноличният собственик на капитала взема решения по всички въпроси, свързани с дейността на дружеството. <br><br>
Чл. 10.  Едноличният собственик има изключителната компетентност за приемане на решения относно: <br>
-  изменение и допълнение на устава; <br>
-  приемане на нови съдружници;<br>
-  даване на съгласие за прехвърляне на дял;<br>
-  вземане на решение за увеличаване и намаляване на уставния капитал на дружеството;<br>
-  приемане на годишните отчети и баланси на дружеството;<br>
-  разпределяне на печалбите на дружеството;<br>
-  избиране и освобождаване от длъжност на управителите на дружеството и техните заместници и определяне на възнаграждението им;<br>
-  откриване и закриване на поделения и представителства и участие или прекратяване на участието в дружества в страната и в чужбина;<br>
-  отчуждаване на недвижими имоти и вещни права върху тях;<br>
-  прекратяване на дружеството. <br><br>
Чл. 11.  Дружеството се управлява и представлява от <b>${name.value.toUpperCase()}, ЕГН: ********** </b>. <br><br>
Чл. 12.  Управителят има следните правомощия: <br>
-  да представлява дружеството;<br>
-  да решава оперативни въпроси, свързани с дейността му;<br>
-  да определя и контролира разходите на дружеството;<br>
-  да урежда отношенията на дружеството с бюджета;<br>
-  да сключва трудови договори с работниците и служителите;<br>
-  да сключва договори с трети лица, свързани със стопанската дейност на дружеството.<br><br>
Чл. 13.  Управителят отговаря имуществено за виновно причинени вреди на дружеството. <br><br>
<h4 style="text-align:center;"> Раздел VI. Имущество </h4> <br><br>
Чл. 14.  Печалбата на дружеството е  в полза на едноличния собственик на капитала, освен ако същият не вземе решение от чистата печалба да се направят
 отчисления във фондовете на дружеството, да се определят средствата за закупуване на имущество, за резерв, за увеличение на капитала и за други цели в 
 интерес на дружеството. Може да бъде взето решение цялата чиста печалба да бъде предназначена за такива цели. <br><br>
Чл. 15.  Когато дружеството приключи годината със загуба, редът за нейното покриване се определя с решение на едноличния собственик на капитала. <br><br>
<h4 style="text-align:center;"> Раздел VII. Прекратяване, Общи разпоредби</h4> <br><br>
Чл. 16.  Дружеството се прекратява с решение на едноличния собственик на капитала и в предвидените от закона случаи. <br><br>
Чл. 17.  За неуредените в този Учредителен акт случаи се прилагат общите разпоредби на Търговския закон на Република България и общото българско законодателство. <br><br>
Чл. 18.  Договорът се състави в два еднообразни екземпляра –за едноличния собственик на капитала и един екземпляр, който да бъде вписан в Агенция по вписванията – Търговски регистър. <br><br><br><br>
 ................<br>
 <b>${own.toUpperCase()}</b> - едноличен собственик <br>
 на капитала на ${firma.value.toUpperCase()}`

  let win = window.open('', '', 'height=700,width=700');

  win.document.write(dekl141, spesimen, reshenieES, dekl13, akt, zalichenAkt);

  win.document.close();

  win.print();

}
