import { html } from 'https://unpkg.com/lit-html?module';
 

export const infoTemplate = () => html`
<div id="info">
    <p>  Преди да попълните документите -  <a href="https://portal.registryagency.bg/CR/Reports/VerificationPersonOrg" target="_blank">направете справка за име на фирма >></a> </p>
    <p>  Ако нямате КЕП - <a href="https://store.borica.bg/bg/b-trust/certificates/qualified/personal/new" target="_blank">заявете онлайн >> </a> </p>
    <p>Ако вече сте принтирали документите, може да преминете към следващите стъпки: <br><br>
       - Откриване на набирателна сметка, внасяне на учредителния капитал и държавна такса;<br><br>
       - Посещение при нотариус за заверка на подписа (това е документът със заглавие 
        <i>"СЪГЛАСИЕ ЗА ПРИЕМАНЕ НА УПРАВЛЕНИЕ И ОБРАЗЕЦ ОТ ПОДПИСА по чл.141 ал.3 от ТЗ". </i> 
        Документът се подписва ПРЕД нотариуса.) 
    </p>
    <p>
      Вече разполагате с пълен набор документи, преминете към входирането им в сайта на ТЪРГОВСКИЯ РЕГИСТЪР. <br>
      Вижте как, като отидете на <a id="video" href="/video">ВИДЕО</a>
    </p>
   
 </div>

`






